Revit 2027 API
RebarConstraint.IsReferenceAValidFaceForConstraint Method
 Checks if the reference provided can be used in creating 'ToFace' or 'ToCover' constraints.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool IsReferenceAValidFaceForConstraint(
	Document document,
	Reference targetReference
)
Public Shared Function IsReferenceAValidFaceForConstraint (
	document As Document,
	targetReference As Reference
) As Boolean
public:
static bool IsReferenceAValidFaceForConstraint(
	Document^ document,
	Reference^ targetReference
)
static member IsReferenceAValidFaceForConstraint :
        document : Document *
        targetReference : Reference -> bool
Parameters
document Document
 The document that contains the reference.
targetReference Reference
 The reference to be checked.
Return Value
Boolean
 Returns true if reference can be used in a constraint of 'ToFace' or 'ToCover' type, false otherwise.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
Remarks
 Reference is valid if it points to an uncut face of a structural that can host Rebar.
See Also
Reference
RebarConstraint Class
Autodesk.Revit.DB.Structure Namespace